type Kana = {
    [kanaName: string]: string;
}

type Dakuon = {
    [kanaName: string]: [string, string];
}

const sutegana: Kana = {
    'ャ': 'ヤ',
    'ュ': 'ユ',
    'ョ': 'ヨ',
    'ッ': 'ツ',
    'ァ': 'ア',
    'ィ': 'イ',
    'ゥ': 'ウ',
    'ェ': 'エ',
    'ォ': 'オ'
};

const dakuon: Dakuon = {
    'ガ': ['カ', '゛'],
    'ギ': ['キ', '゛'],
    'グ': ['ク', '゛'],
    'ゲ': ['ケ', '゛'],
    'ゴ': ['コ', '゛'],
    'ダ': ['タ', '゛'],
    'ヂ': ['チ', '゛'],
    'ヅ': ['ツ', '゛'],
    'デ': ['テ', '゛'],
    'ド': ['ト', '゛'],
    'ザ': ['サ', '゛'],
    'ジ': ['シ', '゛'],
    'ズ': ['ス', '゛'],
    'ゼ': ['セ', '゛'],
    'ゾ': ['ソ', '゛'],
    'バ': ['ハ', '゛'],
    'ビ': ['匕', '゛'],
    'ブ': ['フ', '゛'],
    'ベ': ['ヘ', '゛'],
    'ボ': ['ホ', '゛'],
    'ヴ': ['ウ', '゛']
};

const hanDakuon: Dakuon = {
    'パ': ['ハ', '゜'],
    'ピ': ['匕', '゜'],
    'プ': ['フ', '゜'],
    'ペ': ['ヘ', '゜'],
    'ポ': ['ホ', '゜']
}

export { sutegana, dakuon, hanDakuon }